<template>
  <div >
    <div class="container policy-container">
      <h3>السياسة والخصوصية</h3>
      <div class="policy-page" >
        <div class="text">
          <h5>سياسة 1</h5>
          <p>
            هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
            النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد
            من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.إذا
            كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد
            الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص
            العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير
            من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.ومن هنا وجب على
            المصمم أن مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث
            يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم
            الموقع.ومن هنا وجب على المصمم أن مولد النص العربى مفيد لمصممي
            المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع
            على صورة حقيقية لتصميم الموقع.ومن هنا وجب على المصمم أن
          </p>
        </div>
        <div class="text">
          <h5>سياسة 2</h5>
          <p>
            هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا
            النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد
            من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.إذا
            كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد
            الفقرات كما تريد، النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص
            العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير
            من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.ومن هنا وجب على
            المصمم أن
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup></script>

<style lang="scss">
.policy-container {
    margin-top: 75px;
    margin-bottom: 120px;
  h3 {
    text-align: center;
    margin-bottom: 80px;
  }
  .policy-page {
    border-radius: 16px;
    background: #fff;
    padding: 32px;
    display: flex;
    flex-direction: column;
    gap: 20px;
    h5 {
      font-size: 24px;
      font-style: normal;
      font-weight: 700;
      color: #2d3a4a;
      margin-bottom: 16px;
    }
    p {
      color: #5a7184;
      font-size: 16px;
      font-weight: 400;
      line-height: 32px;
    }
  }
}
</style>
